public class Main {
    public static void main(String[] args) {

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили
        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран

        int ticket = 50326 ;
        int coefficient = 20;
        int bonus = ticket / coefficient;
        System.out.println("Количество начисленных бонусов: " + bonus);

    }
}